Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/C01A.tmx
Source language: en_us
Languages: zh_cn

source: God's Chinese Son
zh_cn: 上帝的中国之子

source: "It's hard to be always on the outside, looking in, but these foreigners have no choice."
zh_cn: “很难让这些觊觎中国的洋人们总在门外徘徊，他们别无选择”

source: That's the immediately arresting first sentence of this book, talking about the earliest - very narrowly circumscribed - foreign trading settlements established at Canton/Guangzhou.
zh_cn: 这本书的第一句话非常有趣，描述了早期备受限制的广州外国商馆。

source: Jonathan Spence's fascinating account of the Taiping Rebellion against the Qing Empire in mid-19th Century China first appeared a dozen or so years ago, but I've only just discovered it.
zh_cn: 史景迁用精彩的手笔写出了19世纪中叶太平天国反抗清朝统治之前若干年的故事，而我也才刚刚发现这一点。

source: It's a bold and unsual choice for a serious historian to craft an account almost entirely in the vivid present tense (often, indeed, as in that striking opening, he seems to be adopting the point of view of one of the protagonists or of a notional Chinese everyman); and, while it can occasionally become a slightly distracting affectation (particularly when he has for a while been forced to dodge backwards or forwards in his narrative, departing for a while from the present tense and then returning to it), it is on the whole very effective in creating an immediacy which secures the reader's full imaginative and emotional involvement in the story.
zh_cn: 这对于一个严肃历史学家来说，用满篇通俗而鲜明的现在时来叙事显得相当大胆而不寻常（的确，就像引人注目的开头那样，他经常采取像主人公或是一个想象中的中国老百姓的视角）；在某些地方叙事显得有些矫揉造作，使人分心（特别是当他有时不得不在叙事中离开现在时，去描述事件的前因后果时），然而总体来说，这本书能轻易而迅速地抓住读者的想象力，并将他们的情感带入故事中。

source: For such a weighty topic, this is a very easy and engaging read.
zh_cn: 这样一个厚重话题，作者却把它写的通俗简单，轻松易读。

source: At the centre of the story is the figure of Hong Xiuquan, a young man from a fairly humble family in southern China who had devoted his life to studying the Confucian classics in order to try to obtain a post in the civil service through the notoriously exacting Imperial examination system.
zh_cn: 洪秀全的形象处于故事的中心位置。他出生于一个中国南方的小康之家，苦心钻研儒家经典，以期通过臭名昭著的皇家科举制度谋求一个官位。

source: After failing in these exams for a second time, he became sick with a fever and during his delirium experienced an extraordinarily protracted, vivid, and detailed dream in which he went to 'heaven', met with 'god', and fought a great battle against a horde of 'demon devils'.
zh_cn: 他在第二次科举落第之后，生了场大病高烧不退，而在精神恍惚中他做了一个漫长、清晰而又活龙活现的大梦，在梦中他曾神游“天国”见到了“天父”，并与一群“阎罗妖”恶战一场。

source: It was only several years later that he puzzled out the significance of this dream in the light of his reading of a foreign book, one of the biblical tracts in Chinese translation which had recently begun to circulate in the country.
zh_cn: 几年之后他在读一篇在中国广泛流传的、洋人在中国宣教用的圣经小册子时，他得到了启发，并苦苦思索着他那意义重大的梦和这有什么关系。

source: Hong became convinced that his dream had been a real experience, that the 'god' he had met had been the Christian god, Jehovah; and moreover that he, Hong, was a second son of God, a younger brother of Jesus, and had been sent to Earth with a sacred commission to convert the Chinese to the true religion and save them from the 'demon devils'.
zh_cn: 洪秀全开始相信他的梦是一场真实的体验，他遇到的“天父”就是基督教中的“上帝”耶和华；不仅如此，洪秀全他本人就是天父的次子，耶稣的弟弟，并被遣下凡间以让中国人皈依正教，并把他们从“阎罗妖”手中解救出来。

source: At first, these 'demon devils' were associated primarily with the superstitious practices of traditional Chinese religions, but as Hong's fledgeling religion grew and started to provoke suspicion and persecution from the local government, it rapidly became politicized and militarized, and began to identify the 'demon devils' as China's Manchu rulers, the "Tartar" invaders from the far north-east who had seized the country two centuries before but were never fully accepted by the indigenous Han Chinese and were now starting to find their grip on power increasingly tenuous.
zh_cn: 最初，这些“阎罗妖”主要指的是中国传统信仰中的迷信活动，然而当洪秀全羽翼未丰的宗教受到地方政府的疑心和迫害时，它很快被政治化军事化了，并开始称“阎罗妖”就是中国的满洲统治者，即是从中国东北来的“鞑靼”侵略者，他们两个世纪前占领了中国然而从未被汉族彻底认可，现在他们的统治变得愈发摇摇欲坠。

source: Hong was remarkably successful in winning converts, and gained considerable assistance from two of his earliest followers who proved to be extremely convincing at 'channelling' the voices of God and Jesus to provide advice and encouragement.
zh_cn: 洪秀全赢得了相当多的信徒，并得到了两个早期追随者的大力襄助；这两人可以“请到”天父天兄的圣音以给众人指点迷津和鼓励，因此让人十分信服。

source: With this appearance of direct divine intervention, Hong soon created a powerful millenarian movement, intent on establishing a Kingdom of God on Earth, the Kingdom of 'Great Peace' - Tai Ping.
zh_cn: 有了天命的直接介入，洪秀全旋即创造了一个千年运动，致力于建立一个人间天国——太平天国。

source: The Taipings soon numbered in the tens of thousands and later in the hundreds of thousands, and at their zenith controlled a broad swathe of central China, with the city of Nanjing established as the capital for their Heavenly Kingdom.
zh_cn: 太平军发展到数以万计，后来又发展到数十万人，在它的极盛期控制了中国中部的大片地区，并将他们的天国定都南京。

source: For 15 years they, and other disaffected groups, waged a bitter civil war against the armies of the imperial government - one of the most terrible wars in history, a conflict that is thought to have left at least 20 million people dead, not only in battle but through brutal massacres and executions, starvation and disease.
zh_cn: 在15年的时间里，太平天国和其他叛乱势力一起，与清朝皇家军队打了一场昏天黑地的大内战——史上最为惨烈的战争之一，导致了两千万人的死亡，除战斗外也包括在屠杀、处决、饥饿和疾病中丧生的人数。

source: Outside of China, this is a history that is probably known little if at all.
zh_cn: 在中国国外，很少有人知道这段历史，甚至对此一无所知。

source: It should be more widely known, since it is one of the keys to understanding China today (for example, the present Communist government's extreme wariness of religion in general, and of cults like the Falun Gong in particular, is tied to the startlingly rapid growth and the ultimately disastrous impact of the Taipings a century and a half ago), and Spence's book makes it very accessible.
zh_cn: 应该有更多的人知道这段历史，因为它是理解今日中国的关键之一（例如，中共政府对所有宗教的高度警觉，特别是像法圈功这样的歪教，发展的速度和灾难性的影响与一个半世纪前的太平天国惊人相似），史景迁把它写的非常深入浅出。

source: This is a book I would highly recommend, even to people who don't normally like non-fiction or history.
zh_cn: 我向大家大力推荐这本书，即使你一般不爱看非小说类文学或历史。
